src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Хозрасчетный</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <chartOfAccounts>Checked</chartOfAccounts>
    <correspondence>Checked</correspondence>
  </extension>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/Базар_ВидыДвиженийМногооборотнойТары/Базар_ВидыДвиженийМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыДвиженийМногооборотнойТары</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДвижениеМногооборотнойТары/ДвижениеМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМногооборотнойТары</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыДвиженийМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПолучатель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузополучатели</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаВодителя</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодичностьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаГруппы</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МногооборотнаяТара</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВМесте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/МногооборотнаяТараСервер/Module.bsl
Функция СуществующиеЭлементыМногооборотнойТары(ЕстьПересчетыНоменклатуры = Истина) Экспорт
	
	ВидНоменклатурыТары = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатурыТары);
	
	Если ЕстьПересчетыНоменклатуры тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НоменклатураМногооборотнаяТара.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.МногооборотнаяТара КАК НоменклатураМногооборотнаяТара
		|ГДЕ
		|	НоменклатураМногооборотнаяТара.Ссылка.ВидНоменклатуры = &ВидНоменклатуры
		|	И НоменклатураМногооборотнаяТара.КоличествоВМесте > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураМногооборотнаяТара.Ссылка";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Ссылка";
	КонецЕсли;
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция СчетаМногооборотнойТары() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("МногооборотнаяТараОстатки"    , Неопределено);
	Результат.Вставить("МногооборотнаяТараПоставщики" , Неопределено);
	Результат.Вставить("МногооборотнаяТараВодители"   , Неопределено);
	Результат.Вставить("МногооборотнаяТараКонтрагенты", Неопределено);
	
	Для Каждого КлючИЗначение из Результат цикл
		
		Результат.Вставить(КлючИЗначение.Ключ,
		                   ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения(
		                         "ПланСчетов",
		                         "Хозрасчетный",
		                         КлючИЗначение.Ключ)
		);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаУчета) Экспорт
	
	ВсеСчетаУчетаЗаполнены = Истина;
	Для Каждого КлючИЗначение из СчетаУчета цикл
		Если НЕ ЗначениеЗаполнено(КлючИЗначение.Значение) тогда
			ВсеСчетаУчетаЗаполнены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеСчетаУчетаЗаполнены;
	
КонецФункции

Процедура ДобавитьВТаблицуПечатиРеализацииМногооборотнуюТару(ДокументРеализация, ТаблицаДокумента) Экспорт
	
	ВидНоменклатурыТара = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара");
	СчетаМТ = СчетаМногооборотнойТары();
	
	Если НЕ ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаМТ) тогда
		Возврат;
	КонецЕсли;
	
	СчетаЗапасов = Новый Массив;
	СчетаЗапасов.Добавить(СчетаМТ.МногооборотнаяТараКонтрагенты);
	
	НомерСубконтоГрузополучателя = 0;
	НомерСубконтоДокумента = 0;
	НомерСубконтоМногооборотнаяТара = 0;
	СчетчикСубконто = 0;
	ВидыСубконто = Новый Массив;
	Для Каждого Субконто Из СчетаМТ.МногооборотнаяТараКонтрагенты.ВидыСубконто Цикл
		
		СчетчикСубконто = СчетчикСубконто + 1;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ДокументРеализация)) тогда
			НомерСубконтоДокумента = СчетчикСубконто;
		КонецЕсли;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ДокументРеализация.Грузополучатель)) тогда
			НомерСубконтоГрузополучателя = СчетчикСубконто;
		КонецЕсли;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура")) тогда
			НомерСубконтоМногооборотнаяТара = СчетчикСубконто;
		КонецЕсли;
		
		ВидыСубконто.Добавить(Субконто.ВидСубконто);
		
	КонецЦикла;
	
	Если НомерСубконтоГрузополучателя = 0
	 ИЛИ НомерСубконтоДокумента = 0
	 ИЛИ НомерСубконтоМногооборотнаяТара = 0 тогда
		Возврат;
	КонецЕсли;
	
	ВидыСубконто = Новый Массив;
	Для Каждого Субконто Из СчетаМТ.МногооборотнаяТараКонтрагенты.ВидыСубконто Цикл
		ВидыСубконто.Добавить(Субконто.ВидСубконто);
	КонецЦикла;
	
	ДатаОстатков = КонецДня(ДокументРеализация.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОстатков"    , ДатаОстатков);
	Запрос.УстановитьПараметр("Грузополучатель" , ДокументРеализация.Грузополучатель);
	Запрос.УстановитьПараметр("ДокументДвижения", ДокументРеализация.Ссылка);
	Запрос.УстановитьПараметр("ВидыСубконто"    , ВидыСубконто);
	Запрос.УстановитьПараметр("СчетаЗапасов"    , СчетаЗапасов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ДокументДвижения КАК Ссылка,
	|	ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Товар,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).Код КАК ТоварКод,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).НаименованиеПолное КАК ТоварНаименование,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ВидСтавкиНДС КАК ВидСтавкиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	""без акциза"" КАК Акциз,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.КоличествоОборотДт, 0)) КАК Количество,
	|	0 КАК Всего,
	|	0 КАК ВсегоРуб,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСРуб,
	|	1 КАК НомерТабЧасти
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			НАЧАЛОПЕРИОДА(&ДатаОстатков, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ),
	|			День,
	|			Счет В (&СчетаЗапасов),
	|			&ВидыСубконто,
	|			Субконто" + НомерСубконтоГрузополучателя + " = &Грузополучатель
	|				И Субконто" + НомерСубконтоДокумента + " = &ДокументДвижения,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + ",
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).НаименованиеПолное,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения.Код,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ЕдиницаИзмерения.Наименование,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК Справочник.Номенклатура).ВидСтавкиНДС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		НоваяСтрокаДокумента = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Выборка);
		
		НоваяСтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Выборка.ВидСтавкиНДС, ДатаОстатков);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиДвиженияМногооборотнойТарыНаОсновании(ДокументОснование, ВидОперации = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
			ВидОперацииЗапроса = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику;
		Иначе
			ВидОперацииЗапроса = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Передача;
		КонецЕсли;
	Иначе
		ВидОперацииЗапроса = ВидОперации;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииЗапроса);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвижениеМногооборотнойТары.Ссылка КАК Ссылка,
	|	ДвижениеМногооборотнойТары.ПометкаУдаления КАК ПометкаУдаления,
	|	ДвижениеМногооборотнойТары.Проведен КАК Проведен
	|ИЗ
	|	Документ.ДвижениеМногооборотнойТары КАК ДвижениеМногооборотнойТары
	|ГДЕ
	|	ДвижениеМногооборотнойТары.ДокументОснование = &ДокументОснование
	|	И ДвижениеМногооборотнойТары.ВидОперации = &ВидОперации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Проведен УБЫВ,
	|	ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецФункции
